{
  "NavBar": {
    "title": "My Portfolio",
    "home": "Home",
    "aboutMe": "About Me",
    "projects": "Projects",
    "contact": "Contact",
    "darkTheme": "Dark Mode",
    "lightTheme": "Light Mode",
    "spanish": "Spanish",
    "english": "English",
    "bg-effect": "BG Effect"
  },
  "HomePage": {
      "name": "Tomas Laprovitta",
      "subtitle": "Full Stack Developer",
      "description": "Hello! I am a Bachelor in Business Administration and a Full Stack Web Developer. This combination of skills allows me to tackle technology and business challenges from a comprehensive perspective.",
      "technologies": "Technologies",
      "ProgrammingLanguages": "Programming Languages",
      "FrameworksAndLibraries": "Frameworks And Libraries",
      "Databases": "Databases",
      "RuntimeEnvironments": "Runtime Environments"
    },
  "Technologies": {
      "React": "React is a JavaScript framework for building user interfaces for web and mobile applications.",
      "Nextjs": "Next.js is a JavaScript framework for building fast and easy-to-develop web and mobile applications.",
      "Tailwind_CSS": "Tailwind CSS is a CSS framework that provides tools to create high-quality user interface designs.",
      "JavaScript": "JavaScript is an interpreted programming language that allows creating interactive and dynamic applications.",
      "TypeScript": "TypeScript is a programming language based on JavaScript with static typing.",
      "CSS": "CSS (Cascading Style Sheets) is a styling language for web documents.",
      "HTML": "HTML (HyperText Markup Language) is a markup language for web pages.",
      "Nodejs": "Node.js is a JavaScript runtime environment for the server.",
      "Expressjs": "Express.js is a Node.js framework for creating fast and scalable web applications.",
      "MongoDB": "MongoDB is a document-oriented NoSQL database.",
      "PostgreSQL": "PostgreSQL is a scalable relational database.",
      "Nestjs": "NestJS is a progressive Node.js framework for building scalable and maintainable server-side applications",
      "Swagger": "Swagger is a tool for documenting, designing, and testing RESTful APIs interactively",
      "TypeORM": "TypeORM is a TypeScript ORM for SQL databases that allows handling the database using objects and classes"
  },
"AboutMePage": {
    "aboutMe": "About Me",
    "aboutMeDescription1": "I hold a Bachelor's degree in Business Administration and am a Full Stack Developer specializing in frontend development. I am proactive, with a strong ability to learn, adapt, and work in teams. My experience has allowed me to develop digital solutions that combine technology and management.",
    "aboutMeDescription2": "My focus is on building digital solutions that are intuitive, attractive, and aligned with business goals. I am passionate about creating products that are not only functional but also innovative, generating real impact in business outcomes.",
    "aboutMeDescription3": "I work with technologies like ",
    "aboutMeTecnologies": "Node.js, JavaScript, React, Next.js, databases, and backend development. ",
    "aboutMeDescription4": "This combination of skills allows me to approach projects comprehensively, covering both frontend and backend, with a focus on efficiency and quality.",
    "aboutMeDescription5": "My blend of administrative and technical skills allows me to understand user needs and organizational goals, achieving a balance between technical functionality and business strategy, resulting in effective solutions aligned with business objectives.",
    "aboutMeDescription6": "I am a dedicated professional, always seeking new knowledge and opportunities to improve. Passionate about programming and technology, I enjoy working in teams and contributing to the creation of digital products that make a difference and generate positive impact."
},
  "ProjectsPage": {
    "title": "My Projects",
    "description": "Description: ",
    "technologies": "Technologies: ",
    "movieTitle": "Movie Platform",
    "movieDescription": "Development of a web platform to view and upload movies through a form, allowing users to add images and details for each movie.",
    "restaurantTitle": "Reservation System",
    "restaurantDescription": "Development of a web application for restaurant table reservations, allowing users to select and manage their reservations efficiently.",
    "ecommerceTitle": "Ecommerce",
    "ecommerceDescription": "Development of an e-commerce platform for the sale of electronic products, providing a smooth and efficient shopping experience.",
    "fitManagerTitle": "FitManager",
    "fitManagerDescription": "Development of a management app for gyms, focused on managing users, data, online payments, and routines.",
    "crudUsersTitle": "API REST",
    "crudUsersDescription": "A CRUD system for user management, developed with NestJS. It allows creating, reading, updating, and deleting users efficiently",
    "repository": "Repository",
    "deployment": "Deployment",
    "video": "Video"
  },
  "ContactPage": {
    "title": "My Social Media",
    "titleModal": "Contact Me",
    "inputName": "Name",
    "inputEmail": "Email",
    "inputMessage": "Message",
    "buttonModal": "Send"
  }
}

