{ 
  "NavBar": {
    "title": "Mi Portafolio",
    "home": "Inicio",
    "aboutMe": "Sobre Mí",
    "projects": "Proyectos",
    "contact": "Contacto",
    "darkTheme": "Modo Oscuro",
    "lightTheme": "Modo Claro",
    "spanish": "Español",
    "english": "Inglés",
    "bg-effect": "Efecto de Fondo"
  },
  "HomePage": {
      "name": "Tomas Laprovitta",
      "subtitle": "Desarrollador Full Stack",
      "description": "¡Hola! Soy Licenciado en Administración de Empresas y Desarrollador Full Stack. Esta combinación de habilidades me permite abordar desafíos tecnológicos y empresariales desde una perspectiva integral.",
      "technologies": "Tecnologías",
      "ProgrammingLanguages": "Lenguajes de Programación",
      "FrameworksAndLibraries": "Frameworks y Librerías",
      "Databases": "Bases de Datos",
      "RuntimeEnvironments": "Entorno de Ejecución"
    },
  "Technologies": {
      "React": "React es un framework de JavaScript para construir interfaces de usuario para aplicaciones web y móviles.",
      "Nextjs": "Next.js es un framework de JavaScript para construir aplicaciones web y móviles rápidas y fáciles de desarrollar.",
      "Tailwind_CSS": "Tailwind CSS es un framework de CSS que proporciona herramientas para crear diseños de interfaz de usuario de alta calidad.",
      "JavaScript": "JavaScript es un lenguaje de programación interpretado que permite crear aplicaciones dinámicas.",
      "TypeScript": "TypeScript es un lenguaje de programación basado en JavaScript con tipado estático.",
      "CSS": "CSS (Cascading Style Sheets) es un lenguaje de estilo para documentos web.",
      "HTML": "HTML (HyperText Markup Language) es un lenguaje de marcado para páginas web.",
      "Nodejs": "Node.js es un entorno de ejecución de JavaScript para el servidor.",
      "Expressjs": "Express.js es un framework de Node.js para crear aplicaciones web rápidas y escalables.",
      "MongoDB": "MongoDB es una base de datos NoSQL orientada a documentos.",
      "PostgreSQL": "PostgreSQL es una base de datos relacional escalable.",
      "Nestjs": "NestJS es un framework progresivo de Node.js para la construcción de aplicaciones del lado del servidor escalables y mantenibles",
      "Swagger": "Swagger es una herramienta para documentar, diseñar y probar APIs RESTful de manera interactiva",
      "TypeORM": "TypeORM es un ORM de TypeScript para bases de datos SQL, que permite manejar la base de datos utilizando objetos y clases"
  },
    "AboutMePage": {
      "aboutMe": "Sobre Mí",
      "aboutMeDescription1": "Soy Licenciado en Administración de Empresas y Desarrollador Full Stack con especialización en frontend. Me considero una persona proactiva, con gran capacidad de aprendizaje, adaptación y trabajo en equipo. Mi experiencia me ha permitido desarrollar soluciones digitales que combinan tecnología y gestión.",
      "aboutMeDescription2": "Mi enfoque se centra en construir soluciones digitales intuitivas, atractivas y alineadas con los objetivos organizacionales. Me apasiona crear productos que no solo sean funcionales, sino también innovadores, para generar un impacto real en el negocio.",
      "aboutMeDescription3": "Trabajo con tecnologías como ",
      "aboutMeTecnologies": "Node.js, JavaScript, TypeScript, React, Next.js, Nest.js, TypeORM, Swagger, PostgreSQL, MongoDB, HTML, CSS, entre otras. ",
      "aboutMeDescription4": "Esta combinación de habilidades me permite abordar proyectos de manera integral, cubriendo tanto el frontend como el backend, con un enfoque en la eficiencia y la calidad.",
      "aboutMeDescription5": "La combinación de mis habilidades administrativas y técnicas me permite comprender las necesidades del usuario y los objetivos organizacionales, logrando un equilibrio entre la funcionalidad técnica y la estrategia empresarial, lo que resulta en soluciones efectivas y alineadas con el negocio.",
      "aboutMeDescription6": "Soy un profesional comprometido, siempre buscando nuevos conocimientos y oportunidades para mejorar. Apasionado por la programación y la tecnología, disfruto trabajar en equipo y contribuir a la creación de productos digitales que marquen la diferencia y generen un impacto positivo."
    },
    "ProjectsPage": {
      "title": "Mis Proyectos",
      "description": "Descripción: ",
      "technologies": "Tecnologías: ",
      "movieTitle": "Plataforma de Películas",
      "movieDescription": "Desarrollo de una plataforma web para visualizar y cargar películas mediante un formulario, permitiendo agregar imagen y detalles de cada película.",
      "restaurantTitle": "Sistema de Reservas",
      "restaurantDescription": "Desarrollo de una aplicación web para la reserva de mesas en restaurantes, permitiendo a los usuarios seleccionar y gestionar sus reservas de manera eficiente.",
      "ecommerceTitle": "Ecommerce",
      "ecommerceDescription": "Desarrollo de una plataforma e-commerce para la comercialización de productos electrónicos, permitiendo una experiencia de compra fluida y eficiente.",
      "fitManagerTitle": "FitManager",
      "fitManagerDescription": "Desarrollo de una aplicación de gestión para gimnasios, enfocada en administrar usuarios, datos, pagos online y rutinas.",
      "crudUsersTitle": "API REST",
      "crudUsersDescription": "Un sistema CRUD para la gestión de usuarios, desarrollado con NestJS. Permite crear, leer, actualizar y eliminar usuarios de manera eficiente.",
      "festivalTitle": "ARGENTINA ROCK",
      "festivalDescription": "Plataforma web para comprar entradas del festival de rock nacional más esperado.",
      "repository": "Repositorio",
      "deployment": "Despliegue",
      "video": "Video"
    },
    "ContactPage": {
      "title": "Mis Redes Sociales",
      "titleModal": "Contáctame",
      "inputName": "Nombre",
      "inputEmail": "Correo",
      "inputMessage": "Mensaje",
      "buttonModal": "Enviar"
    }
}
